---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsConstructionTypeShadingfactorParam
source: html/144b1f03-332c-e6e9-1fbf-5b1aa46abeda.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsConstructionTypeShadingfactorParam Property

"Internal Shading Factor"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsConstructionTypeShadingfactorParam { get; }
```